var data = {
    date: ' بتاريخ 04 جانفي 2024',
    typeCx: 'تهريب ممممم',
    location : " "
};
var bodyHeight
function printBRQ1(data) {


    var htmlpage =
        '<div class="page"> <div class="header">  <div>    <h3>الجمهورية الجزائرية الديمقراطية الشعبية</h3>    <h4>وزارة المالية</h4>    <h4>المديرية العامة للجمارك</h4>' +
        ' <h4>المديرية الجهوية للجمارك ببشار</h4>' +
        '<h4>' +
        data.date +
        '</h4> </div> '+
      /*  <img src="../../../static/img/logo.png" alt="Logo">+*/
'</div><div class="content"> <h2>كشف المعلومات اليومية</h2>  <table>    <tbody>' +
        '<tr>' +
        '<td>طبيعة المخالفة</td>' +
        '<td>' + data.typeCx + '</td>' +
        '</tr>' +
        '<tr>' +
        '<td>مكان اكتشاف المخالفة بالضبط</td>' +
        '<td>' + data.location+'</td>'+
        '</tr>' +
        '<tr>' +
        '<td>التاريخ و الساعة</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>تعيين البضائع محل الغش (النوع/الكمية/الوزن)</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>قيمة البضائع محل الغش</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td> قيمة وسائل  النقل</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>تقنية عملية الغش</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>وسيلة النقل المستعملة</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>هوية المخالفين:  الاسم - تاريخ و مكان الازدياد / الابوين / الجنسية <br>العنوان - رقم بطاقة التعريف الوطنية - جواز السفر - البطاقة المهنية </td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>تحديد هوية الشركاء و المستفيدين من الغش</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>المصلحة الحاجزة</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>تقنية كشف الغش</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td> الاجرائات المتخدة</td>' +
        '<td></td>' +
        '</tr>' +
        '<tr>' +
        '<td>النصوص القانونية</td>' +
        '<td> </td>' +
        '</tr>' +
        '</tbody>' +
        '</table>' +
        '</div>' ;
var footer=
        '<div class="footer">' +
        '<h4 style="text-decoration: underline;">المرسل اليهم:</h4>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +

    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<br>'+
    '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +
        '<p>السيد اللواء المدير العام للجمارك (الامانة الخاصة)</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 200</p>' +
        '<p>ٍالسيد اللواء المدير العام للجمارك  م د 02</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 03</p>' +
        '<p>السيد اللواء المدير العام للجمارك م د 08</p>' +



        '</div>' +
        ' <span id="pagenumber">';

var footerLength = footer.length;

if(footerLength>1000)

console.log(footerLength)
        bodyHeight = document.body.clientHeight;
    var pagenumber =parseInt( bodyHeight/1117)

    htmlpage+= footer+  pagenumber + '</span></div>'



        document.body.innerHTML += htmlpage;

}
for(i=1;i< 2 ; i++)
printBRQ1(data);

